# Главный класс приложения (роутер вкладок)

# ```
# ╭──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────╮
# │                                                                                                                      │
# │                                                                                                                      │
# │                                                  ██╗  █████╗  ██╗    ██╗ ██╗                                         │
# │                                                  ██║ ██╔══██╗ ██║    ██║ ██║                                         │
# │                                                  ██║ ███████║ ██║ █╗ ██║ ██║                                         │
# │                                             ██   ██║ ██╔══██║ ██║███╗██║ ██║                                         │
# │                                             ╚█████╔╝ ██║  ██║ ╚███╔███╔╝ ███████╗                                    │
# │                                              ╚════╝  ╚═╝  ╚═╝  ╚══╝╚══╝  ╚══════╝                                    │
# │                                                      Just A While Loop                                               │
# │                                                                                                                      │
# ╰───────────────────────────────────────────────────────── v0.9 ───────────────────────────────────────────────────────╯

# ? Добро пожаловать в JAWL. Выберите действие: (Используйте стрелочки ↑/↓ и Enter)
#    🚀 Запустить агента
#    ⏹️ Остановить агента
#    ⏹️ Открыть чат с агентом
#    🛠️ Открыть мониторинг статуса
#  » 📋 Открыть логи
#    ⚙️ Настроить интерфейсы
#    🧹 Очистить память агенту
#    ❌ Выход
# ```