




# Тут будет подобное главное меню: 
# Именно оно будет открывать при запуске фреймворка (через файл jawl.py)

# ╭──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────╮
# │                                                                                                                      │
# │                                                                                                                      │
# │                                               ██╗  █████╗  ██╗    ██╗ ██╗                                            │
# │                                               ██║ ██╔══██╗ ██║    ██║ ██║                                            │
# │                                               ██║ ███████║ ██║ █╗ ██║ ██║                                            │
# │                                          ██╗  ██║ ██╔══██║ ██║███╗██║ ██║                                            │
# │                                          ╚█████╔╝ ██║  ██║ ╚███╔███╔╝ ███████╗                                       │
# │                                           ╚════╝  ╚═╝  ╚═╝  ╚══╝╚══╝  ╚══════╝                                       │
# │                                                   Just A While Loop                                                  │
# │                                                                                                                      │
# ╰─────────────────────────────────────────────────────── v0.9.0 ───────────────────────────────────────────────────────╯

# Добро пожаловать в JAWL. Выберите действие: (Используйте стрелочки ↑/↓ и Enter)
#  » 🚀 Запустить агента
#    ⏹️ Остановить агента
#    📋 Открыть логи
#    ⚙️ Мастер настройки
#    🧹 Полный сброс памяти
#    ❌ Выход
